{
  "chapIndex": "Introduction to Simultaneous Equations",
  "text": "With blue jeans and Chelsea Football Jersey which her dad bought for her from London with the nickname first lady printed at the back she was set for outing to air boredom and her mom was on duty that morning. Mr. Bello decided to take his daughter for a ride round town.\r\n\r\nThings got her attention during the drive, she saw girls of her age running round selling wares which made her feel they had freedom since they had opportunities to go anywhere and meet anyone unlike her who lived behind fence which her grandma called prison.\r\n\r\nStopping by Aunty Gigi's they bought vanilla chocolate ice cream and fresh orange juice for Daddy. The ice cream helped Daddy to break the silence and ask her if she knew ice cream affected women's menstruation which Aliya replied NO.\r\n\r\nMr Bello has always wanted to discuss such discussion with her since she's gradually becoming matured. Seeing the ice cream as an opportunity, he went further to ask her what she knew about menstruation.\r\n\r\nHer response \"Mum and Aunt taught me how to menstruate\" got her father laughing. He corrected her daughter by saying \"you are not taught how to menstruate but what to do during such period\".\r\n\r\nAliya remembered her mum telling her that boys touching her she could get pregnant but she knew that was not possible as she knew about sex and had also read in Aunty Molara's magazine (cosmopolitan).\r\n\r\nShe could also remember her dad telling her that her mind was a beautiful room and should not allow things like bad language, violence, vulgarity to be properties in the room. In addition she should avoid bad friends and sternly he told her that she should not allow anyone to check her private.\r\n\r\nAliya read her 16th birthday letter again and again, loved the letter, it made her cry without knowing, had pure love for her father, and purposed in her mind to keep the letter for her children.\r\n\r\nAliya is still so much interested in making good grades in her Chemistry..."
}