{
  "chapIndex": "Describing Design Patterns",
  "text": "How do we describe design patterns?  Graphical notations, while important and useful, aren't sufficient. They simply capture the end product of the design process as relationships between classes and objects. To reuse the design, we must also record the decisions, alternatives, and trade-offs that led to it. Concrete examples are important too, because they help you see the design in action. We describe design patterns using a consistent format. Each pattern is divided into sections according to the following template. The template lends a uniform structure to the information, making design patterns easier to learn, compare, and use.The pattern's name conveys the essence of the pattern succinctly. A good name is vital, because it will become part of your design vocabulary. The pattern's classification reflects the scheme we introduce in Section 1.5. IntentA short statement that answers the following questions: What does the design pattern do? What is its rationale and intent? What particular design issue or problem does it address? Also Known AsOther well-known names for the pattern, if any. MotivationA scenario that illustrates a design problem and how the class and object structures in the pattern solve the problem. The scenario will help you understand the more abstract description of the pattern that follows. ApplicabilityWhat are the situations in which the design pattern can be applied? What are examples of poor designs that the pattern can address? How can you recognize these situations? StructureA graphical representation of the classes in the pattern using a notation based on the Object Modeling Technique (OMT) [RBP+91]. We also use interaction diagrams [JCJO92, Boo94] to illustrate sequences of requests and collaborations between objects. Appendix B describes these notations in detail. ParticipantsThe classes and/or objects participating in the design pattern and their responsibilities. CollaborationsHow the participants collaborate to carry out their responsibilities."
}